In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
d1 = Series(['one','two',np.nan,'four'])

In [3]:
d1

0     one
1     two
2     NaN
3    four
dtype: object

In [4]:
d1.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
d1.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [7]:
d1.dropna()

0     one
1     two
3    four
dtype: object

In [8]:
df = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [9]:
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [10]:
clean_df = df.dropna()

In [11]:
clean_df

     0    1    2
0  1.0  2.0  3.0

In [12]:
df.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [13]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [16]:
df2 = DataFrame([[1,2,3,np.nan],[1,2,3,np.nan],[1,np.nan,3,np.nan],[np.nan,np.nan,3,np.nan]])

In [17]:
df2

     0    1  2   3
0  1.0  2.0  3 NaN
1  1.0  2.0  3 NaN
2  1.0  NaN  3 NaN
3  NaN  NaN  3 NaN

at threshold 2 data points

In [18]:
df2.dropna(thresh=2)

     0    1  2   3
0  1.0  2.0  3 NaN
1  1.0  2.0  3 NaN
2  1.0  NaN  3 NaN

In [19]:
df2

     0    1  2   3
0  1.0  2.0  3 NaN
1  1.0  2.0  3 NaN
2  1.0  NaN  3 NaN
3  NaN  NaN  3 NaN

fill values

In [20]:
df2.fillna(1)

     0    1  2    3
0  1.0  2.0  3  1.0
1  1.0  2.0  3  1.0
2  1.0  1.0  3  1.0
3  1.0  1.0  3  1.0

In [22]:
df2

     0    1  2   3
0  1.0  2.0  3 NaN
1  1.0  2.0  3 NaN
2  1.0  NaN  3 NaN
3  NaN  NaN  3 NaN

Using dictionary

In [23]:
df2.fillna({0:0,1:1,2:2,3:3})

     0    1  2    3
0  1.0  2.0  3  3.0
1  1.0  2.0  3  3.0
2  1.0  1.0  3  3.0
3  0.0  1.0  3  3.0